## Plane Crash Data Exploration and Analysis

#### Budhajit Roy Chanamthabam

In [1]:
# import necessary libraries
#https://www.kaggle.com/budhajit/plane-crash-information-dataset

import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import requests
import json
from bs4 import BeautifulSoup
import warnings
import re
import datetime
warnings.filterwarnings('ignore')

In [2]:
def set_data(year, dates):
    date = []
    time = []
    location = []
    operator = []
    flight_number = []
    route = []
    aircraft_type = []
    registration = []
    cn_ln = []
    aboard = []
    fatalities = []
    ground = []
    summary = []
    final_data = {}

    for i in range(len(dates)):
        url1 = "http://www.planecrashinfo.com/"+str(year)+"/"+str(year)+"-"+str(i+1)+".htm"
        #print(url)
        r1 = requests.get(url1)
        htm_doc = r1.text  

        soup1 = BeautifulSoup(htm_doc)
        td_tags = soup1.find_all('td')

        test = []
        for items in td_tags:
            test.append(items.text)

        # add the data details to their corresponding lists
        date.append(test[3])
        time.append(test[5])
        location.append(test[7])
        operator.append(test[9])
        flight_number.append(test[11])
        route.append(test[13])
        aircraft_type.append(test[15])
        registration.append(test[17])
        cn_ln.append(test[19])
        aboard.append(test[21])
        fatalities.append(test[23])
        ground.append(test[25])
        summary.append(test[27])
        
    final_data['date'] = date
    final_data['time'] = time
    final_data['location'] = location
    final_data['operator'] = operator
    final_data['flight_number'] = flight_number
    final_data['route'] = route
    final_data['aircraft_type'] = aircraft_type
    final_data['registration'] = registration
    final_data['cn_ln'] = cn_ln
    final_data['aboard'] = aboard
    final_data['fatalities'] = fatalities
    final_data['ground'] = ground
    final_data['summary'] = summary
    
    return final_data

In [4]:
# setting up the data for each year and creating the dataframe

for year in range(1920,2020):    
    url = "http://www.planecrashinfo.com/"+str(year)+"/"+str(year)+".htm"
    r = requests.get(url)
    html_doc = r.text
    soup = BeautifulSoup(html_doc)
    a_tags = soup.find_all('a')
    dates = []
    for link in a_tags:
        #print(link.text) # this returns the text
        dates.append(link.text)
        #print(link.get('href')) # this returns the link
    dates = dates[:-1]
    year_df = set_data(year,dates)
    if year!= 1920:
        temp_df = pd.DataFrame(year_df)
        final_df = pd.concat([final_df,temp_df])
    else:
        final_df = pd.DataFrame(year_df)

In [5]:
final_df.shape

(5242, 13)

In [7]:
final_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 5242 entries, 0 to 0
Data columns (total 13 columns):
date             5242 non-null object
time             5242 non-null object
location         5242 non-null object
operator         5242 non-null object
flight_number    5242 non-null object
route            5242 non-null object
aircraft_type    5242 non-null object
registration     5242 non-null object
cn_ln            5242 non-null object
aboard           5242 non-null object
fatalities       5242 non-null object
ground           5242 non-null object
summary          5242 non-null object
dtypes: object(13)
memory usage: 573.3+ KB

In [8]:
final_df.head()

,date,time,location,operator,flight_number,route,aircraft_type,registration,cn_ln,aboard,fatalities,ground,summary
0,"September 17, 1908",17:18,"Fort Myer, Virginia",Military - U.S. Army,?,Demonstration,Wright Flyer III,?,1,2 (passengers:1 crew:1),1 (passengers:1 crew:0),0,"During a demonstration flight, a U.S. Army fly..."
1,"September 07, 1909",?,"Juvisy-sur-Orge, France",?,?,Air show,Wright Byplane,SC1,?,1 (passengers:0 crew:1),1 (passengers:0 crew:0),0,Eugene Lefebvre was the first pilot to ever be...
2,"July 12, 1912",06:30,"Atlantic City, New Jersey",Military - U.S. Navy,?,Test flight,Dirigible,?,?,5 (passengers:0 crew:5),5 (passengers:0 crew:5),0,First U.S. dirigible Akron exploded just offsh...
3,"August 06, 1913",?,"Victoria, British Columbia, Canada",Private,?,?,Curtiss seaplane,?,?,1 (passengers:0 crew:1),1 (passengers:0 crew:1),0,The first fatal airplane accident in Canada oc...
4,"September 09, 1913",c 18:30,Over the North Sea,Military - German Navy,?,?,Zeppelin L-1 (airship),?,?,20 (passengers:? crew:?),14 (passengers:? crew:?),0,The airship flew into a thunderstorm and encou...

In [9]:
final_df.tail()

,date,time,location,operator,flight_number,route,aircraft_type,registration,cn_ln,aboard,fatalities,ground,summary
15,"September 28, 2018",1010,"Chuuk, Micronesia",Air Niugini,?,Pohnpei - Chuuk,Boeing 737-8BK,P2-PXE,33024/1688,47 (passengers:35 crew:12),1 (passengers:1 crew:0),0,The aircraft was approaching for a landing at ...
16,"October 29, 2018",0631,"Off Jakarta, Indonesia",Lion Air,610,Jakarta - Pangkal Pinang,Boeing 737-MAX 8,PK-LQP,43000/7058,189 (passengers:181 crew:8),189 (passengers:181 crew:8),0,"The airliner crashed into the Jakarta Sea, 13 ..."
17,"November 06, 2018",0253,"Georgetown, Guyana",Fly Jamaica Airways,?,Georgetown - Toronto,Boeing 757-N23,N524AT,30233/895,128 (passengers:120 crew:8),1 (passengers:1 crew:0),0,"After taking off and reaching FL200, the crew ..."
18,"November 18, 2018",2300,"Near Mandan, North Dakota",Metro Area Ambulance Services,?,Bismark - Sloulin Field,Cessna 441 Conquest II,N441CX,441-0305,3 (passengers:2 crew:1),3 (passengers:2 crew:1),0,The air ambulance en route to pick up a patien...
0,"January 14, 2019",0830,"Karaj, Iran",Saha Air,?,Bishkek - Payam,Boeing 707-3J9C,EP-CPP,21128/917,16 (passengers:13 crew:3),15 (passengers:13 crew:2),0,The cargo plane was operated by the Iranian Ai...

In [11]:
final_df = final_df.reset_index(drop=True)
final_df.to_csv("plane_crash_data.csv", index = False)

In [12]:
final_df.columns

Index(['date', 'time', 'location', 'operator', 'flight_number', 'route',
       'aircraft_type', 'registration', 'cn_ln', 'aboard', 'fatalities',
       'ground', 'summary'],
      dtype='object')

## Read data from CSV

In [2]:
df = pd.read_csv("plane_crash_data.csv")
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5242 entries, 0 to 5241
Data columns (total 13 columns):
date             5242 non-null object
time             5242 non-null object
location         5242 non-null object
operator         5242 non-null object
flight_number    5242 non-null object
route            5242 non-null object
aircraft_type    5242 non-null object
registration     5242 non-null object
cn_ln            5242 non-null object
aboard           5242 non-null object
fatalities       5242 non-null object
ground           5242 non-null object
summary          5242 non-null object
dtypes: object(13)
memory usage: 532.5+ KB

In [3]:
df.describe()

,date,time,location,operator,flight_number,route,aircraft_type,registration,cn_ln,aboard,fatalities,ground,summary
count,5242,5242,5242,5242,5242,5242,5242,5242,5242,5242,5242,5242,5242
unique,4742,1287,4327,2633,808,3529,2557,4888,3781,982,871,52,4876
top,"February 28, 1973",?,"Moscow, Russia",Aeroflot,?,?,Douglas DC-3,?,?,2 (passengers:0 crew:2),1 (passengers:0 crew:1),0,?
freq,4,1917,16,217,4043,1338,310,321,1092,224,272,4964,210

In [4]:
df.tail()

,date,time,location,operator,flight_number,route,aircraft_type,registration,cn_ln,aboard,fatalities,ground,summary
5237,"September 28, 2018",1010,"Chuuk, Micronesia",Air Niugini,?,Pohnpei - Chuuk,Boeing 737-8BK,P2-PXE,33024/1688,47 (passengers:35 crew:12),1 (passengers:1 crew:0),0,The aircraft was approaching for a landing at ...
5238,"October 29, 2018",0631,"Off Jakarta, Indonesia",Lion Air,610,Jakarta - Pangkal Pinang,Boeing 737-MAX 8,PK-LQP,43000/7058,189 (passengers:181 crew:8),189 (passengers:181 crew:8),0,"The airliner crashed into the Jakarta Sea, 13 ..."
5239,"November 06, 2018",0253,"Georgetown, Guyana",Fly Jamaica Airways,?,Georgetown - Toronto,Boeing 757-N23,N524AT,30233/895,128 (passengers:120 crew:8),1 (passengers:1 crew:0),0,"After taking off and reaching FL200, the crew ..."
5240,"November 18, 2018",2300,"Near Mandan, North Dakota",Metro Area Ambulance Services,?,Bismark - Sloulin Field,Cessna 441 Conquest II,N441CX,441-0305,3 (passengers:2 crew:1),3 (passengers:2 crew:1),0,The air ambulance en route to pick up a patien...
5241,"January 14, 2019",0830,"Karaj, Iran",Saha Air,?,Bishkek - Payam,Boeing 707-3J9C,EP-CPP,21128/917,16 (passengers:13 crew:3),15 (passengers:13 crew:2),0,The cargo plane was operated by the Iranian Ai...

### Cleaning required.

- convert date in to date format
- related to time data:
    - time data also contains the character 'c' in 322 observations.
    - time data has missing semi-colons.
    - time data has "?" for missing data
    - many other unwanted characters.
- location can be split into region and country columns.
- Operator can again be split into private, passenger service and military. (will have to find the operations first ).
- flight number: there are missing flight number informations represented by "?"
- route: can be split into : source and destination locations
- aboard can be further split into : total_aboard, passenger, crew
- fatalities can be again further split into passenger and crew.
-

### Convert data into Date Format

In [10]:
#using different functions
def get_month(month_string):
    month_string = month_string.lower()
    return {
        'january': "1',
        'february': '2',
        'march':'3',
        'april':'4',
        'may':'5',
        'june':'6',
        'july':'7',
        'august':'8',
        'september':'9',
        'october':'10',
        'november':'11',
        'december':'12'
    }[month_string]

In [25]:
def convert_date(date_string):
    month_val = date_string.split(" ")[0]
    month_str = get_month(month_val)
    
    date_val = date_string.split(" ")[1].split(",")[0]
    year_val = date_string.split(" ")[2]
    
    final_date = str(month_str)+"-"+str(date_val)+"-"+str(year_val)
    
    return final_date

In [31]:
test_df['date_new'] = test_df['date'].apply(convert_date)

In [43]:
#https://discuss.analyticsvidhya.com/t/how-to-convert-string-to-date-in-pandas-dataframe-using-python/17674
s=pd.Series(["Jan.3,2017", "feb.4,2016", "mar.2,2017", "apr.3,2015" , "apr.3,2016"])
sf=pd.DataFrame(s, columns =["date_col"])
print (pd.to_datetime(sf.date_col, format="%b.%d,%Y"))

0   2017-01-03
1   2016-02-04
2   2017-03-02
3   2015-04-03
4   2016-04-03
Name: date_col, dtype: datetime64[ns]

In [48]:
s = test_df['date']
#sf = pd.DataFrame(s, columns = ['date_col'])
#test_df["new_date1"] = 
#print(pd.to_datetime(s,format = "%B %d, %Y"))

0      1908-09-17
1      1909-09-07
2      1912-07-12
3      1913-08-06
4      1913-09-09
5      1913-10-17
6      1915-03-05
7      1915-09-03
8      1916-07-28
9      1916-09-24
10     1916-10-01
11     1916-11-21
12     1916-11-28
13     1917-03-04
14     1917-03-30
15     1917-05-14
16     1917-06-14
17     1917-06-17
18     1917-08-21
19     1917-10-20
20     1918-04-07
21     1918-05-10
22     1918-08-11
23     1918-12-16
24     1919-05-25
25     1919-07-19
26     1919-08-02
27     1919-10-02
28     1919-10-14
29     1919-10-20
          ...
5212   2017-05-05
5213   2017-05-15
5214   2017-05-27
5215   2017-06-07
5216   2017-06-28
5217   2017-07-10
5218   2017-10-14
5219   2017-11-15
5220   2017-12-13
5221   2017-12-31
5222   2018-01-29
5223   2018-02-10
5224   2018-02-11
5225   2018-02-18
5226   2018-03-06
5227   2018-03-11
5228   2018-03-12
5229   2018-03-17
5230   2018-04-11
5231   2018-04-17
5232   2018-05-02
5233   2018-05-18
5234   2018-06-05
5235   2018-07-10
5236   2018-08-04
5237   2018-09-28
5238   2018-10-29
5239   2018-11-06
5240   2018-11-18
5241   2019-01-14
Name: date, Length: 5242, dtype: datetime64[ns]

In [3]:
# use this date conversion **********************************
s = test_df['date']
test_df['new_date'] = pd.to_datetime(s,format = "%B %d, %Y")

In [4]:
test_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5242 entries, 0 to 5241
Data columns (total 14 columns):
date             5242 non-null object
time             5242 non-null object
location         5242 non-null object
operator         5242 non-null object
flight_number    5242 non-null object
route            5242 non-null object
aircraft_type    5242 non-null object
registration     5242 non-null object
cn_ln            5242 non-null object
aboard           5242 non-null object
fatalities       5242 non-null object
ground           5242 non-null object
summary          5242 non-null object
new_date         5242 non-null datetime64[ns]
dtypes: datetime64[ns](1), object(13)
memory usage: 573.4+ KB

## Cleaning time data column

In [3]:
# count the number of observations with "?"
df.query('time == "?"').shape[0]

1917

In [25]:
# 
test_df['time'] = test_df['time'].replace('?', np.nan)

In [26]:
# check the dataset
df.query('time == "?"').shape[0]

0

In [4]:
# function to check if the time values are of the format 00:00
def check_pattern(time_val):
    pattern = re.compile('^\d{2}\:\d{2}$') 
    result = pattern.match(time_val)
    return bool(result)

In [5]:
# lets check if the time data has the pattern 00:00
pattern_check = df['time'].apply(check_pattern)

In [6]:
pattern_check[pattern_check == False].count()

2436

In [7]:
# there are time values that contains character "c"
df[df['time'].str.contains("c")].shape[0]

322

In [8]:
# there are time values that contains character "c: "
df[df['time'].str.contains("c: ")].shape[0]

2

In [9]:
# there are time values that contains character "Z"
df[df['time'].str.contains("Z")].shape[0]

47

Lets create a function to clean up all the unwanted characters in the time data and add necessary values.

In [11]:
# function to replace "?", remove "c" and to add ":" for all the missing : in time data

def clean_time(time_data):
    time_data = time_data.strip()
    
    ignore_list = ["c:","c: ","c","c ","z","Z"," "]
    
    if time_data == "?":
        time_data = "00:00"
        
    if ":" not in time_data:
        time_data = time_data[:2] + ':' + time_data[2:]
    
    if len(time_data) < 5:
        time_data = time_data.zfill(5)
    
    for tag in ignore_list:
        if tag == 'z' or tag == 'Z':
            time_data = time_data.replace(tag, '')
        else:
            time_data = time_data.replace(tag, '0')

        
    new_str = time_data[-5:]
    return new_str

In [12]:
# apply clean_time function to the time column
df['time'] = df['time'].apply(clean_time)

In [13]:
# check if the time values satisfies the 00:00 format
test = df['time'].apply(check_pattern)

In [14]:
test[test == False].count()

12

In [15]:
test_index = test[test == False].index

In [16]:
df['time'].iloc[test_index]

398     10;00
549     13;00
552     4:;10
644     12;30
841     6:;15
905     3:;00
974     2:;00
1782    2:"20
2029    8:.40
4706    6:;30
4791    6:;30
5039    0:900
Name: time, dtype: object

In [17]:
# function to remove additional extra unwanted characters
def remove_extra_characters(time_data):

    ignore_list = [":;",":.",":\"",";"]

    for tag in ignore_list:
        time_data = time_data.replace(tag, ':')

    if len(time_data) < 5:
        time_data = time_data.zfill(5)
    
    return time_data

In [18]:
df['time'] = df['time'].apply(remove_extra_characters)

In [19]:
test2 = df['time'].apply(check_pattern)

In [20]:
t2_index = test2[test2 == False].index

In [21]:
df['time'].iloc[t2_index]

5039    0:900
Name: time, dtype: object

Now we can clean the data for the index 5039. And since there cannot be 90 minutes, it seems that the data has been input wrongly. So, I think it should be 09:00

In [22]:
df.iloc[5039]['time'] = '09:00'

In [23]:
df.iloc[5039]['time']

'09:00'

## Cleaning up Date data column

In [38]:
df.date.sample(5)

1930        June 16, 1963
1701    December 08, 1959
403        March 26, 1936
2865         May 10, 1977
1124    November 21, 1950
Name: date, dtype: object

In [55]:
#ignore this
t12 = 'January 20, 1942'
pattern_date = re.compile('^[a-zA-Z]{1,20}\s\d{2}\,\s\d{4}$')
#pattern_date = re.compile('[a-zA-Z]\s') #('[a-zA-Z]{20}\s\d{2}\,\s\d{4}') 
result = pattern_date.match(t12)
print(bool(result))

True

In [62]:
pattern_date = re.compile('^[a-zA-Z]{1,20}\s\d{2}\,\s\d{4}$')
date_format_check = df['date'].apply(lambda x: "True" if bool(pattern_date.match(x)) == True else "False")

In [63]:
date_format_check.unique()

array(['True'], dtype=object)

All the date values are of the same format.

## Cleaning up location data column

In [65]:
df.sample(5)

,date,time,location,operator,flight_number,route,aircraft_type,registration,cn_ln,aboard,fatalities,ground,summary
1123,"November 17, 1950",00:00,"Surabaya, Indonesia",Garuda Indonesia Airlines,?,?,Douglas DC-3,PK-DPB,19005,23 (passengers:20 crew:3),2 (passengers:0 crew:2),0,Veered off the runway and crashed into a ditch..
653,"June 14, 1943",00:00,"Near Mackay, OLD, Australia",Military - U.S. Army Air Forces,?,?,B-17C Flying Fortress,?,?,41 (passengers:? crew:?),40 (passengers:? crew:?),0,The aircraft took off into ground fog and leve...
3246,"January 09, 1983",00:00,"Brainerd, Minnesota",46826/109,927,Minneapolis-St Paul - Brainerd,Convair 580-11A,N844H,327A,33 (passengers:30 crew:3),1 (passengers:1 crew:0),0,"The plane landed 1,725 feet beyond the runway ..."
1602,"May 31, 1958",00:00,"Rio de Janeiro, Brazil",Paraense Transportes Aéreos,?,?,Curtiss C-46D,PP-BTB,33304,4 (passengers:0 crew:4),4 (passengers:0 crew:4),0,"The plane plunged into the water when, a front..."
4104,"October 04, 1995",00:00,"Barskoon, Kirghizia",Kirghizia Aba Zaoldoru,?,?,Mil Mi-8MTV-1,EX-25179,95489,15 (passengers:12 crew:3),15 (passengers:12 crew:3),0,Crashed into mountains at Barskoon Pass while ...

In [66]:
df[df['location'] == "?"].shape[0]

5

#### Observations
- missing location values are filled with "?".
- contains unwanted escape characters.
- split the location into region and country values.

In [67]:
# function to remove unwanted escape characters from the location string
def remove_escape_characters(loc_string):
    ignore_list_escape_characters = ["\n","\t","\r"]

    for char in ignore_list_escape_characters:
        loc_string = loc_string.replace(char, '')
        
    return loc_string

In [68]:
# remove escape characters from the location data
df['location'] = df['location'].apply(remove_escape_characters)

In [421]:
#ignore this
t_Str = "August 09, 2013"
pattern = re.compile('^[a-zA-Z]{1,20}\s\d{2}\,\s\d{4}$')
result = pattern.match(t_Str)
print(result)

<_sre.SRE_Match object; span=(0, 15), match='August 09, 2013'>

In [332]:
#ignore this
pattern = re.compile('^[a-zA-Z\, \.\-]{1,50}, [a-zA-Z ]{1,50}$')
result = pattern.match("Mt, Taylor, near Grants")
print(result)

<_sre.SRE_Match object; span=(0, 23), match='Mt, Taylor, near Grants'>

In [69]:
# function to split the location data into region and country data

def split_region_country(location):
    region = ""
    country= ""
    if location == "?":
        region = "-"
        country = "-"          
    elif location.count(",") == 0:
        region = location
        country = "-"       
    elif location.count(",") == 1:
        region = location.split(",")[0]
        country = location.split(",")[1]
    elif location.count(",") >= 2:
        n = location.count(",") 
        for i in range(n):
            region = region + location.split(",")[i].strip()+ " "
        country = location.split(",")[n].strip()
    ret_val = pd.Series([region, country])

    return ret_val

# not able to return tuples : https://stackoverflow.com/questions/23690284/pandas-apply-function-that-returns-multiple-values-to-rows-in-pandas-dataframe

In [70]:
df['region'], df['country'] = df['location'].apply(split_region_country)[0],df['location'].apply(split_region_country)[1]

In [71]:
df.head()

,date,time,location,operator,flight_number,route,aircraft_type,registration,cn_ln,aboard,fatalities,ground,summary,region,country
0,"September 17, 1908",17:18,"Fort Myer, Virginia",Military - U.S. Army,?,Demonstration,Wright Flyer III,?,1,2 (passengers:1 crew:1),1 (passengers:1 crew:0),0,"During a demonstration flight, a U.S. Army fly...",Fort Myer,Virginia
1,"September 07, 1909",00:00,"Juvisy-sur-Orge, France",?,?,Air show,Wright Byplane,SC1,?,1 (passengers:0 crew:1),1 (passengers:0 crew:0),0,Eugene Lefebvre was the first pilot to ever be...,Juvisy-sur-Orge,France
2,"July 12, 1912",06:30,"Atlantic City, New Jersey",Military - U.S. Navy,?,Test flight,Dirigible,?,?,5 (passengers:0 crew:5),5 (passengers:0 crew:5),0,First U.S. dirigible Akron exploded just offsh...,Atlantic City,New Jersey
3,"August 06, 1913",00:00,"Victoria, British Columbia, Canada",Private,?,?,Curtiss seaplane,?,?,1 (passengers:0 crew:1),1 (passengers:0 crew:1),0,The first fatal airplane accident in Canada oc...,Victoria British Columbia,Canada
4,"September 09, 1913",18:30,Over the North Sea,Military - German Navy,?,?,Zeppelin L-1 (airship),?,?,20 (passengers:? crew:?),14 (passengers:? crew:?),0,The airship flew into a thunderstorm and encou...,Over the North Sea,-

In [72]:
df.query('region == "?"')

Empty DataFrame
Columns: [date, time, location, operator, flight_number, route, aircraft_type, registration, cn_ln, aboard, fatalities, ground, summary, region, country]
Index: []

In [73]:
df.query('country == "?"')

Empty DataFrame
Columns: [date, time, location, operator, flight_number, route, aircraft_type, registration, cn_ln, aboard, fatalities, ground, summary, region, country]
Index: []

In [383]:
#ignore this
def check_pattern_location(loc_string):
    pattern = re.compile("^[a-zA-Z0-9\/\~\\'\, \.\-]{1,50}, [a-zA-Z0-9 ]{1,50}$")
    result = pattern.match(loc_string)
    return bool(result)

In [384]:
t5 = df['location'].apply(check_pattern_location)

In [385]:
t5_index = t5[t5 == False].index

In [403]:
df.iloc[t5_index]['location'].sample(5)

683                         China
2798                 Havana. Cuba
1137    Mt. Bukit, Besar,Thailand
590                  Sea of Japan
4              Over the North Sea
Name: location, dtype: object

- Operator contains some escape characters.
- flight number: there are missing flight number informations represented by "?"
- route: can be split into : source and destination locations
- aboard can be further split into : total_aboard, passenger, crew
- fatalities can be again further split into passenger and crew.

### Cleaning up Operator data columns.

In [77]:
df.operator.sample(5)

3916    Military - Afghan Republican Air Force
1477                           Indian Airlines
2543         Amazonese Importacao e Exportacao
441                           United Air Lines
2559                           Inter City Flug
Name: operator, dtype: object

#### Observations
- Need to remove unwanted escape characters.
- Can create a new additional column that states either "Military" or "Commercial" flight.

In [78]:
# remove escape characters from operator
df['operator'] = df['operator'].apply(remove_escape_characters)

### Create a new column to specify operator type: Military or Commercial

In [79]:
# function to create if the aircraft is a military or a commercial type
check_type = lambda x: "Military" if "military" in x.lower() else "Commercial"

In [80]:
type_check = map(lambda x: "Military" if "military" in x.lower() else "Commercial", df['operator'])

In [81]:
# create the column operator_type stating "Miliary" or "Commercial"
df['operator_type'] = pd.Series(list(type_check))

In [82]:
df[['operator','operator_type']].sample(5)

                                   operator operator_type
1335              Military - U.S. Air Force      Military
447                      Deutsche Lufthansa    Commercial
3549                            Oxaero Ltd.    Commercial
1905                    West Coast Airlines    Commercial
2810  Military - Imperial Iranian Air Force      Military

### Cleaning flight_number data columns.

In [83]:
df['flight_number'].value_counts()

?            4043
-              63
1              11
4               7
201             6
21              6
301             6
6               6
101             6
901             5
706             5
601             5
701             5
200             5
202             5
7               5
3               5
112             4
261             4
114             4
304             4
703             4
214             4
205             4
10              4
8               4
902             4
105             4
610             4
542             4
             ...
163             1
3838            1
1422            1
3183            1
400             1
466             1
1016            1
42              1
290             1
3780            1
940             1
5463            1
383             1
5017            1
865             1
215             1
E-15            1
3352            1
595             1
1802            1
3378            1
4412            1
422             1
104             1
Batcat 19       1
1008            1
1658            1
1668            1
4230            1
347             1
Name: flight_number, Length: 808, dtype: int64

#### Observations
- contains "?" for missing flight numbers.

In [84]:
# replace "?" with "-"
df['flight_number'] = df['flight_number'].apply(lambda x: "-" if x =="?" else x)

In [85]:
# check if all "?" are replaced by "-"
df['flight_number'].value_counts()

-            4106
1              11
4               7
301             6
101             6
201             6
6               6
21              6
200             5
601             5
701             5
706             5
3               5
901             5
7               5
202             5
112             4
542             4
105             4
11              4
114             4
304             4
703             4
205             4
10              4
610             4
214             4
191             4
8               4
261             4
             ...
93              1
163             1
3838            1
1422            1
3183            1
400             1
466             1
1016            1
3780            1
940             1
5463            1
4230            1
248             1
383             1
5017            1
865             1
215             1
E-15            1
3352            1
595             1
1802            1
3378            1
4412            1
422             1
104             1
Batcat 19       1
1008            1
1658            1
1668            1
347             1
Name: flight_number, Length: 807, dtype: int64

### Cleaning the "route" data column.

In [87]:
df['route'].sample(5)

4810                   Pau - Paris
3590            Cucuta - Cartagena
2592    Palma de Mallorca - London
3305              Medellin - Miami
3740                             -
Name: route, dtype: object

In [27]:
# remove escape characters
df['route'] = df['route'].apply(remove_escape_characters)

#### Observations:
- contains unwanted escape characters
- ? character for missing values
- check index 3652

In [86]:
# replace "?" for missing values with "-"
df['route'] = df['route'].apply(lambda x: "-" if x =="?" else x)

In [89]:
df.iloc[3652]['route']

'? - Tegucigalpa - Toncontin'

It seems the source region for the index 3652 is unknow, so lets remove the unwanted "? - ".

In [90]:
df.iloc[3652]['route'] = 'Tegucigalpa - Toncontin'

In [91]:
df.iloc[3652]['route']

'Tegucigalpa - Toncontin'

### Cleaning "aboard" data column.

In [92]:
df['aboard'].sample(5)

2198    39   (passengers:33  crew:6)
4543      3   (passengers:1  crew:2)
5142    17   (passengers:11  crew:6)
5111      2   (passengers:0  crew:2)
2804      6   (passengers:5  crew:1)
Name: aboard, dtype: object

#### Observations
- are of the format "39   (passengers:33  crew:6)
- can further split into 3 new columns - total_aboard, total_passengers_aboard and total_crew_aboard

In [93]:
# check if the string "passengers:" is contained in all data values
def check_passenger(test_str):
    if "passengers:" in test_str:
        return "True"
    else:
        return "False"

In [94]:
str_check = df['aboard'].apply(check_passenger)

In [95]:
str_check.unique()

array(['True'], dtype=object)

In [189]:
str_check[str_check == "False"].count()

0

In [96]:
# Similarly check for string "crew:"
def check_crew(test_str):
    if "crew:" in test_str:
        return "True"
    else:
        return "False"

In [97]:
str_check = df['aboard'].apply(check_crew)
str_check[str_check == "False"].count()

0

In [98]:
# function to split the aboard data into three new values
def aboard_check(total_aboard):
    total_aboard_count = []
    passengers_aboard = []
    crew_aboard = []
    total_aboard = total_aboard.strip()
    total_count = total_aboard.split(" ")[0]
    passenger_count = total_aboard.split("passengers:")[1].split(" ")[0]
    crew_count = total_aboard.split("crew:")[1]   
    crew_count = crew_count[:-1]
    
    total_count = total_count.strip()
    passenger_count = passenger_count.strip()
    crew_count = crew_count.strip()
    
    ret_val = pd.Series([total_count, passenger_count, crew_count])    
    return ret_val

In [99]:
board_counts = df['aboard'].apply(aboard_check)

In [100]:
# replace all "?" with nan
board_counts[0] = board_counts[0].replace('?', np.nan)
board_counts[1] = board_counts[1].replace('?', np.nan)
board_counts[2] = board_counts[2].replace('?', np.nan)

In [101]:
# create the three new columns
df['tot_boarded_count'] = board_counts[0]
df['tot_passengers_boarded'] = board_counts[1]
df['tot_crews_boarded'] = board_counts[2]

In [102]:
# convert the new column types into float
df['tot_boarded_count'] = df['tot_boarded_count'].astype(float)
df['tot_passengers_boarded'] = df['tot_passengers_boarded'].astype(float)
df['tot_crews_boarded'] = df['tot_crews_boarded'].astype(float)

In [103]:
# check the new columns
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5242 entries, 0 to 5241
Data columns (total 19 columns):
date                      5242 non-null object
time                      5242 non-null object
location                  5242 non-null object
operator                  5242 non-null object
flight_number             5242 non-null object
route                     5242 non-null object
aircraft_type             5242 non-null object
registration              5242 non-null object
cn_ln                     5242 non-null object
aboard                    5242 non-null object
fatalities                5242 non-null object
ground                    5242 non-null object
summary                   5242 non-null object
region                    5242 non-null object
country                   5242 non-null object
operator_type             5242 non-null object
tot_boarded_count         5205 non-null float64
tot_passengers_boarded    4750 non-null float64
tot_crews_boarded         4754 non-null float64
dtypes: float64(3), object(16)
memory usage: 778.2+ KB

In [104]:
df.head()

,date,time,location,operator,flight_number,route,aircraft_type,registration,cn_ln,aboard,fatalities,ground,summary,region,country,operator_type,tot_boarded_count,tot_passengers_boarded,tot_crews_boarded
0,"September 17, 1908",17:18,"Fort Myer, Virginia",Military - U.S. Army,-,Demonstration,Wright Flyer III,?,1,2 (passengers:1 crew:1),1 (passengers:1 crew:0),0,"During a demonstration flight, a U.S. Army fly...",Fort Myer,Virginia,Military,2.0,1.0,1.0
1,"September 07, 1909",00:00,"Juvisy-sur-Orge, France",?,-,Air show,Wright Byplane,SC1,?,1 (passengers:0 crew:1),1 (passengers:0 crew:0),0,Eugene Lefebvre was the first pilot to ever be...,Juvisy-sur-Orge,France,Commercial,1.0,0.0,1.0
2,"July 12, 1912",06:30,"Atlantic City, New Jersey",Military - U.S. Navy,-,Test flight,Dirigible,?,?,5 (passengers:0 crew:5),5 (passengers:0 crew:5),0,First U.S. dirigible Akron exploded just offsh...,Atlantic City,New Jersey,Military,5.0,0.0,5.0
3,"August 06, 1913",00:00,"Victoria, British Columbia, Canada",Private,-,-,Curtiss seaplane,?,?,1 (passengers:0 crew:1),1 (passengers:0 crew:1),0,The first fatal airplane accident in Canada oc...,Victoria British Columbia,Canada,Commercial,1.0,0.0,1.0
4,"September 09, 1913",18:30,Over the North Sea,Military - German Navy,-,-,Zeppelin L-1 (airship),?,?,20 (passengers:? crew:?),14 (passengers:? crew:?),0,The airship flew into a thunderstorm and encou...,Over the North Sea,-,Military,20.0,NaN,NaN

### Cleaning up "fatalities" data column.

"fatalities" data column format is similar to "aboard", so the same cleaning steps can be applied. Moreover, three new columns for fatalities can be further created for fatalities.

In [105]:
fatalities_count = df['fatalities'].apply(aboard_check)

In [106]:
# replace missing values "?" with nan
fatalities_count[0] = fatalities_count[0].replace('?', np.nan)
fatalities_count[1] = fatalities_count[1].replace('?', np.nan)
fatalities_count[2] = fatalities_count[2].replace('?', np.nan)

In [107]:
# create new fatalities columns
df['tot_fatalities_count'] = fatalities_count[0]
df['passengers_fatalities'] = fatalities_count[1]
df['tot_crews_fatalities'] = fatalities_count[2]

In [108]:
# convert the datatype to 
df['tot_fatalities_count'] = df['tot_fatalities_count'].astype(float)
df['passengers_fatalities'] = df['passengers_fatalities'].astype(float)
df['tot_crews_fatalities'] = df['tot_crews_fatalities'].astype(float)

In [109]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5242 entries, 0 to 5241
Data columns (total 22 columns):
date                      5242 non-null object
time                      5242 non-null object
location                  5242 non-null object
operator                  5242 non-null object
flight_number             5242 non-null object
route                     5242 non-null object
aircraft_type             5242 non-null object
registration              5242 non-null object
cn_ln                     5242 non-null object
aboard                    5242 non-null object
fatalities                5242 non-null object
ground                    5242 non-null object
summary                   5242 non-null object
region                    5242 non-null object
country                   5242 non-null object
operator_type             5242 non-null object
tot_boarded_count         5205 non-null float64
tot_passengers_boarded    4750 non-null float64
tot_crews_boarded         4754 non-null float64
tot_fatalities_count      5231 non-null float64
passengers_fatalities     4736 non-null float64
tot_crews_fatalities      4738 non-null float64
dtypes: float64(6), object(16)
memory usage: 901.0+ KB

Now the data columns "aboard" and "fatalities" can be removed.

In [113]:
col = ['aboard','fatalities']
df.drop(col, axis=1, inplace=True)

In [114]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5242 entries, 0 to 5241
Data columns (total 20 columns):
date                      5242 non-null object
time                      5242 non-null object
location                  5242 non-null object
operator                  5242 non-null object
flight_number             5242 non-null object
route                     5242 non-null object
aircraft_type             5242 non-null object
registration              5242 non-null object
cn_ln                     5242 non-null object
ground                    5242 non-null object
summary                   5242 non-null object
region                    5242 non-null object
country                   5242 non-null object
operator_type             5242 non-null object
tot_boarded_count         5205 non-null float64
tot_passengers_boarded    4750 non-null float64
tot_crews_boarded         4754 non-null float64
tot_fatalities_count      5231 non-null float64
passengers_fatalities     4736 non-null float64
tot_crews_fatalities      4738 non-null float64
dtypes: float64(6), object(14)
memory usage: 819.1+ KB

In [115]:
# lets save the cleaned data set
df.to_csv("plane_crash_cleaned_data.csv", index = False)